const resumeList = [
  {
    content: `## 個人原則

    我認為原則比目前擁有的技能還重要，技能可以短時間內透過刻意練習習得，但原則、價值觀可不是一下子就會改變的，甚至可能一輩子都不會變。
    
    您可以透過這部分來先了解我的個人原則，如果光是看完這邊的介紹，就知道我並非您心中期望的人選，那麼技能部分與工作經驗其實也不太重要了。個人能力終究只是「必要」條件而已，適不適合公司的文化才是關鍵，因此會稍微花點篇幅介紹個人原則的部分。
    
  ### 對事不對人
    
    大部分情況都是「理性」對待任何事物，不太會因為個人情感的因素有所偏頗，尤其工作的時候更是如此，即便是面對討厭的人，也不會就此處處反對對方提出的意見，相反的，對於有好感的人，也大多是抱持著公正的態度，幾乎不會有偏袒的情況，但有時候會被說有點冷淡就是了。
    
  ### 不堅持己見
    
    只要對方的意見、建議能讓結果變得更好，這時不會固執於自己的意見，以大局整體的利益為優先。而相對的，如果客觀的整體評估之後，自己的方案是遠遠優於其他方案的話，仍然會堅持到底，畢竟如果能達到好結果和採用自己的方案，能兩全其美當然是更好的。
    
  ### 先規劃再說
    
    現在大家都在鼓吹「先做再說、Just Do It」，但我認為要這麼做的前提是要先有「最低程度的準備規劃」，否則一股腦兒向前衝只會是沒效率的做法。
    
    舉個例子來說，程式這領域（無論前後端、任何語言），只要有在這行業內有待過的人幾乎都有感受過，那些令人很「痛」教訓，就是「沒有事先規劃好」就寫的程式，俗稱的「技術債」就是如此。
    
    因為急於交付功能而沒先做好問題定義、釐清問題所在、規劃架構設計...等，只做出那些「看起來可以動」的程式，就直接提交並部署了，直到問題發生才在那邊「拆炸彈」，這樣的事情在朋友口中或是層出不窮，自己也曾深受其害，也從別人手中接下炸彈...。
    
    儘管自己知道有技術債這種問題，但礙於經驗的不足，有時還是無法避免埋下炸彈，但至少知道該怎麼拆這些炸彈。且有時因為時間、預算的關係，無法充分進行規劃就要趕緊交付，這時我會做好「最低程度的規劃」，至少先向PM、客戶等相關人物問清楚再著手進行，至少這樣才不會反覆修改，畢竟時間就是金錢，也省得以後維護的困擾。`,
  },
];

export default resumeList;
